#+title: papers

* 数据处理
#+begin_src python :results output raw
data = {'precision@10': 0.0072820776549239515, 'precision@20': 0.005613268192337154, 'recall@10': 0.0658808950542044, 'recall@20': 0.10132092329829538, 'ndcg@10': 0.03534804649739116, 'ndcg@20': 0.04449428653973039}
for i, (key, value) in enumerate(data.items()):
    if i >= 2:
        print(f"|{round(value, 4)}", end="")
#+end_src

#+RESULTS:
| 0.0659 | 0.1013 | 0.0353 | 0.0445 |









* 实验
** MIG-GT_3.8
#+NAME: 实验_baby_SumPooling:增加权重
|   R@10 |   R@20 |   N@10 |   N@20 | 方法    |      |
|--------+--------+--------+--------+---------+------|
| 0.0634 |  0.099 | 0.0344 | 0.0436 | etv:334 |      |
| 0.0632 |  0.097 | 0.0342 | 0.0429 | etv:424 |      |
| 0.0646 |  0.100 | 0.0354 | 0.0444 | etv:442 |      |
| 0.0657 | 0.1022 | 0.0355 | 0.0448 | etv:532 | sota |
| 0.0631 | 0.0993 | 0.0342 | 0.0435 | etv:622 |      |
| 0.0642 | 0.0992 | 0.0351 | 0.0441 | etv:352 |      |

#+NAME: 复现
|   R@10 |   R@20 |   N@10 |   N@20 | 数据集   |
|--------+--------+--------+--------+----------|
| 0.0656 | 0.1018 | 0.0355 | 0.0448 | baby     |
| 0.0738 | 0.1120 | 0.0406 | 0.0505 | sports   |
| 0.0632 | 0.0931 | 0.0351 | 0.0426 | clothing |

#+NAME: 论文
|   R@10 |   R@20 |   N@10 |   N@20 | 数据集   |
|--------+--------+--------+--------+----------|
| 0.0665 | 0.1021 | 0.0361 | 0.0452 | baby     |
| 0.0753 | 0.1130 | 0.0414 | 0.0511 | sports   |
| 0.0636 | 0.0934 | 0.0347 | 0.0422 | clothing |


* route [2/7]
- [X] vscode远程debug
- [X] Sum Pooling: 权重
- [ ] autodl上部署MIG-GT、测试
- [ ] 脚本：多次实验并给出最佳结果
- [ ] Sum Pooling: 自适应权重
- [ ] 多任务学习
- [ ] 新论文


** someday
- 农业方面的多模态语义分割
* MIG-GT
/medias/data/202321116012525_ysh/MIG-GT-main
├── main.py                  # 主训练入口，包含参数解析、数据加载、模型训练、评估全流程
├── mig_gt                   # 核心算法实现
│   ├── layers/              # 模型层组件
│   │   ├── common.py        # 基础网络组件（自定义线性层、激活函数、MLP等）
│   │   ├── mgdcf.py         # MGDCF图卷积核心实现
│   │   └── mirf_gt.py       # MIG-GT主模型架构
│   ├── configs/            # 配置文件
│   │   └── default_config.py # 默认超参数配置
│   ├── utils/              # 工具模块
│   │   ├── data_loader_utils.py # 数据加载工具
│   │   └── random_utils.py # 随机种子控制
│   └── evaluation/         # 评估模块
│       └── ranking.py      # 排序指标计算（NDCG/Recall等）
├── data/                   # 数据集
│   ├── baby/               # 具体数据集
│   │   ├── image_feat.npy  # 图像特征
│   │   └── text_feat.npy   # 文本特征
├── configs/                # 数据集配置
│   └── dataset/
│       └── baby.yaml       # 数据集路径/字段定义
├── utils/                  # 通用工具
│   ├── logger.py           # 日志记录模块
│   └── data_utils.py      # 数据预处理工具
├── log/                    # 训练日志
│   └── FREEDOM-*.log       # 具体训练日志文件
└── README.md               # 项目说明文档

* 备忘录
** cityscapes帐号密码
202321116012525@stu.hubu.edu.cn
diablorrr1905A!

